console.log('======================== 初級 ここから ========================');

// 問題1
console.log('======================== 初級問題1 ここから ========================');

console.log('======================== 初級問題1 for文記述 ここから ========================');

for (let i = 1; i <= 5; i++) {
    console.log(i);
}

console.log('======================== 初級問題1 for文記述 ここまで ========================');

console.log('======================== 初級問題1 while文記述 ここから ========================');

let numWhile = 1;

while (numWhile <= 5) {
    console.log(numWhile);
    numWhile++;
}

console.log('======================== 初級問題1 while文記述 ここまで ========================');

console.log('======================== 初級問題1 do...while文記述 ここから ========================');

let numDo = 1;

do {
    console.log(numDo);
    numDo++;

} while (numDo <= 5);

console.log('======================== 初級問題1 do...while文記述 ここまで ========================');

console.log('======================== 初級問題1 ここまで ========================');

// 問題2
console.log('======================== 初級問題2 ここから ========================');
for (let i = 5; i >= 1; i--) {
    console.log(i);
}

console.log('======================== 初級問題2 ここまで ========================');

// 問題3
console.log('======================== 初級問題3 ここから ========================');
for (let i = 1; i <= 3; i++) {
    console.log('こんにちは');
}

console.log('======================== 初級問題3 ここまで ========================');

// 問題4
console.log('======================== 初級問題4 ここから ========================');
for (let i = 2; i <= 10; i += 2) {
    console.log(i);
}

console.log('======================== 初級問題4 ここまで ========================');

// 問題5
console.log('======================== 初級問題5 ここから ========================');
const drinks = ['水', 'お茶', 'コーヒー'];

for (const drink of drinks) {
    console.log(`${drink}を注文しました。`);

}

console.log('======================== 初級問題5 ここまで ========================');

console.log('======================== 初級 ここまで ========================');

console.log('======================== 中級 ここから ========================');

// 問題1
console.log('======================== 中級問題1 ここから ========================');
let totalNum = 0;

for (let i = 1; i <= 10; i++) {
    totalNum += i;
}

console.log(totalNum);

console.log('======================== 中級問題1 ここまで ========================');

// 問題2
console.log('======================== 中級問題2 ここから ========================');
const prices = [500, 800, 1200, 300];
let totalPrice = 0;

for (const price of prices) {
    totalPrice += price;
}

console.log(totalPrice);

console.log('======================== 中級問題2 ここまで ========================');

// 問題3
console.log('======================== 中級問題3 ここから ========================');
for (let i = 1; i <= 6; i++) {
    if (i === 5) {
        break;
    }
    console.log(i);
}

console.log('======================== 中級問題3 ここまで ========================');

// 問題4
console.log('======================== 中級問題4 ここから ========================');
for (let i = 1; i <= 6; i++) {
    if (i % 2 === 0) {
        continue;
    }
    console.log(i);
}

console.log('======================== 中級問題4 ここまで ========================');

// 問題5
console.log('======================== 中級問題5 ここから ========================');
for (let i = 1; i <= 15; i++) {
    if (i % 3 === 0 && i % 5 === 0) {
        console.log('FizzBuzz');

    } else if (i % 3 === 0) {
        console.log('Fizz');

    } else if (i % 5 === 0) {
        console.log('Buzz');

    } else {
        console.log(i);

    }
}

console.log('======================== 中級問題5 ここまで ========================');


console.log('======================== 中級 ここまで ========================');

