/* ========================
   * P119 繰り返し
======================== */

/* ========================
   idea while文（条件を決めて繰り返すタイプ01）
======================== */
console.log('======================== while文 ここから ========================');
let whileCount = 1;

while (whileCount <= 3) {
    console.log(`${whileCount}番目の処理。`);
    whileCount++;

}

console.log('======================== while文 ここまで ========================');

/* ========================
   idea do...while文（条件を決めて繰り返すタイプ02）
======================== */
console.log('======================== do...while文 ここから ========================');
let doWhileCount = 10;
do {
    console.log(`${doWhileCount}番目の処理です。`);
    doWhileCount++;
    // note 絶対一度は処理される
} while (doWhileCount <= 3);

console.log('======================== do...while文 ここまで ========================');

/* ========================
   idea for文（カウンター変数を使って繰り返すタイプ）
======================== */
// ! for(カウンター変数の設定(初期化式); 繰り返しの条件(条件式); １回の繰り返しが終わった後の処理(更新式);)

console.log('======================== for文 ここから ========================');
for (let i = 1; i <= 3; i++) {
    console.log(`${i}番目の処理です`);
}

let count = 1;

for (let i = 10; i >= 0; i--) {
    console.log(`${count}回目の処理です。数値は${i}です。`);
    count++;

}

console.log('======================== for文 中断 ここまで ========================');

for (let count = 1; count <= 5; count++) {
    if (count === 3) {
        console.log(`${count}回目です。処理を抜けます。`);
        break;
    }
    console.log(`${count}回目の処理。`);

}

console.log('======================== for文 中断 ここまで ========================');

console.log('======================== for文 スキップ ここまで ========================');

for (let count = 1; count <= 5; count++) {
    if (count === 3) {
        console.log(`${count}回目です。処理をスキップします。`);
        continue;
    }
    console.log(`${count}回目の処理。`);

}

console.log('======================== for文 スキップ ここまで ========================');

console.log('======================== for文 ここまで ========================');

/* ========================
   idea for~of文（配列の要素数だけ繰り返すタイプ）
======================== */

console.log('======================== for~of文 ここまで ========================');

const colors = ['赤', '青', '黄'];

for (const color of colors) {
    console.log(`${color}色`);

}

// note forEach

colors.forEach(color => {
    console.log(`${color}色`);

});


console.log('======================== for~of文 ここまで ========================');