// review 非同期処理を簡単に記述できる async / awaitキーワード
// idea 基礎
// note 非同期処理を行う際、async / awaitというキーワードがある。これらを使うことで、簡単に非同期処理を組むことが可能。

// * async = 関数名や関数宣言の際に、asyncと記述することで、非同期関数を作ることが可能。

// todo 非同期関数宣言
// note asyncをつけた関数の中で、awaitというキーワードを使うことが可能。

// ! 外部のサーバーなどからデータを取得し、その取得データを使って、画面上に何かを表示、データ処理をしたい場合は、async / awaitを使うと簡単に実装ができる。

// note 例: 天気予報のデータをWebサイトに表示したい場合。まず、気象庁や天気予報のデータを外部に取りに行き、データが正しく取得できたら、その情報をHTMLに記述するという動作。

// note 例: ユーザーの会員情報データを画面に表示するような動作など。

// ! これらは順番が崩れると、画面表示がエラーとなる。

// ? 天気予報のデータが届いていないのに、画面に天気予報の結果を表示しようとすれば、当然出ない。そのため、データ取得が終わるまで、次の処理を止めておく必要がある。

// todo その場合に、asyncで関数を作り、awaitキーワードで外部データを取りにいく処理を記述する。そうすれば、次の処理を止めて、データ取得ができたら次の処理に進むことができる。

// ! 主にAPI操作でこの非同期処理 async / awaitが使われる

// ? async / awaitは例外処理ができない。Promiseオブジェクトの場合は、例外処理が組めるが、async / awaitはプログラムの実行作業のみなので、例外処理がasync / awaitだけではできない。

// ! そこで、Chapter11で学習した例外処理をasync / awaitに組み込むことで、例外処理を扱うことができる。

// note そのため、async / awaitと、try~catch文、Errorオブジェクトなどの知識が総合的に必要となる。

// * JSON = 外部サーバーのデータを取得した場合、多くの場合がJSON形式でデータが返ってくる。このJSONデータをHTML容赦JavaScript内で処理して、画面表示させる。

// idea JSON = JavaScript Object Notationの略。厳密には異なるが、JavaScriptのオブジェクトとほぼ同じ形式。

// note そのため、外部データを扱うということは、

// todo ① 非同期処理を使って、外部データを撮りに行く
// todo ② JSONが返ってくるので、オブジェクト処理を使って、必要なデータを取り出す
// todo ③ DOM操作でHTMLにJSONオブジェクトから値を渡す
// todo ④ ②が失敗したら、例外処理でプログラムが止まらないようにする

// note この流れが定番となっている

async function add() {

    // * await = 先頭にawaitと書かれた処理があった場合、この処理が終わるまで、次の行以下の処理が止まる。ただし、このawaitは非同期処理となるため、プログラム全体は止まらない。

    await // review --- 非同期処理内容 --- //
        console.log('awaitの処理が終わったら実行される');
};

// todo 関数式
const add2 = async function () { };

// todo アロー関数
const add3 = async () => { };